In [1]:
import numpy as np 
import pandas as pd

In [9]:
reptiles = pd.DataFrame(np.arange(16).reshape(4,4), index=[1,2,3,4], columns=['Cobra','Crocodile','Lizard','Chameleon'])
reptiles

   Cobra  Crocodile  Lizard  Chameleon
1      0          1       2          3
2      4          5       6          7
3      8          9      10         11
4     12         13      14         15

In [10]:
reptiles[reptiles['Lizard']>5]

   Cobra  Crocodile  Lizard  Chameleon
2      4          5       6          7
3      8          9      10         11
4     12         13      14         15

In [11]:
reptiles < 6

   Cobra  Crocodile  Lizard  Chameleon
1   True       True    True       True
2   True       True   False      False
3  False      False   False      False
4  False      False   False      False

In [12]:
reptiles[reptiles > 10] = 20
reptiles

   Cobra  Crocodile  Lizard  Chameleon
1      0          1       2          3
2      4          5       6          7
3      8          9      10         20
4     20         20      20         20

In [15]:
reptiles.loc[2, ['Cobra','Crocodile']]

Cobra        4
Crocodile    5
Name: 2, dtype: int32

In [16]:
reptiles.iloc[2,[3,0,1]]

Chameleon    20
Cobra         8
Crocodile     9
Name: 3, dtype: int32

In [17]:
data.iloc[2]

Cobra         8
Crocodile     9
Lizard       10
Chameleon    11
Name: 3, dtype: int32

In [18]:
data.iloc[[1,2],[3,0,1]]

   Chameleon  Cobra  Crocodile
2          7      4          5
3         11      8          9

In [19]:
reptiles.loc[:2,'Cobra']

1    0
2    4
Name: Cobra, dtype: int32

In [20]:
reptiles.iloc[:, :3][reptiles.Cobra > 5]

   Cobra  Crocodile  Lizard
3      8          9      10
4     20         20      20

In [21]:
#iloc: select by integer position
#loc: select by label

### Inter Position

In [22]:
zzz = pd.Series(np.arange(3.))
zzz

0    0.0
1    1.0
2    2.0
dtype: float64

In [24]:
zzz2 = pd.Series(np.arange(3.), index= ['z','x','y'])
zzz2

z    0.0
x    1.0
y    2.0
dtype: float64

In [33]:
zzz2[0:1]

z    0.0
dtype: float64

In [34]:
zzz2.iloc[:1]

z    0.0
dtype: float64

### Arithmetic and Data Alingnment

In [35]:
yyy = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a','c','d','e'])
yyy

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [36]:
iii = pd.Series([-2.1,3.6,-1.5,4,3.1], index= ['a','c','e','f','g'])
iii

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [37]:
yyy + iii

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [50]:
anfiber = pd.DataFrame(np.arange(9.).reshape((3,3)), columns=list('bcd'),
index=['Frog', 'Toad', 'Axolote'])
anfiber

           b    c    d
Frog     0.0  1.0  2.0
Toad     3.0  4.0  5.0
Axolote  6.0  7.0  8.0

In [51]:
anfiber2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
index=['Merman', 'Urodela', 'Caudata', 'Apoda'])
anfiber2

           b     d     e
Merman   0.0   1.0   2.0
Urodela  3.0   4.0   5.0
Caudata  6.0   7.0   8.0
Apoda    9.0  10.0  11.0

In [52]:
anfiber + anfiber2

          b   c   d   e
Apoda   NaN NaN NaN NaN
Axolote NaN NaN NaN NaN
Caudata NaN NaN NaN NaN
Frog    NaN NaN NaN NaN
Merman  NaN NaN NaN NaN
Toad    NaN NaN NaN NaN
Urodela NaN NaN NaN NaN

In [53]:
anfiber2.loc[1, 'b'] = np.nan

In [54]:
anfiber

           b    c    d
Frog     0.0  1.0  2.0
Toad     3.0  4.0  5.0
Axolote  6.0  7.0  8.0

In [55]:
anfiber2

           b     d     e
Merman   0.0   1.0   2.0
Urodela  3.0   4.0   5.0
Caudata  6.0   7.0   8.0
Apoda    9.0  10.0  11.0
1        NaN   NaN   NaN

In [56]:
anfiber + anfiber2

          b   c   d   e
1       NaN NaN NaN NaN
Apoda   NaN NaN NaN NaN
Axolote NaN NaN NaN NaN
Caudata NaN NaN NaN NaN
Frog    NaN NaN NaN NaN
Merman  NaN NaN NaN NaN
Toad    NaN NaN NaN NaN
Urodela NaN NaN NaN NaN

In [57]:
anfiber.add(anfiber2, fill_value=0)

           b    c     d     e
1        NaN  NaN   NaN   NaN
Apoda    9.0  NaN  10.0  11.0
Axolote  6.0  7.0   8.0   NaN
Caudata  6.0  NaN   7.0   8.0
Frog     0.0  1.0   2.0   NaN
Merman   0.0  NaN   1.0   2.0
Toad     3.0  4.0   5.0   NaN
Urodela  3.0  NaN   4.0   5.0

In [58]:
1 / anfiber

                b         c      d
Frog          inf  1.000000  0.500
Toad     0.333333  0.250000  0.200
Axolote  0.166667  0.142857  0.125

In [59]:
anfiber.rdiv(1)

                b         c      d
Frog          inf  1.000000  0.500
Toad     0.333333  0.250000  0.200
Axolote  0.166667  0.142857  0.125

In [60]:
anfiber.reindex(columns= anfiber2.columns, fill_value=0)

           b    d  e
Frog     0.0  2.0  0
Toad     3.0  5.0  0
Axolote  6.0  8.0  0

In [61]:
zxz = np.arange(12.).reshape((3,4))
zxz

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [62]:
zxz[0]

array([0., 1., 2., 3.])

In [64]:
jojo = pd.DataFrame(np.arange(12.).reshape((4,3)), columns=list('bde'), index=['jotaro','giorno','jonathan','josuke'])

In [65]:
series = jojo.iloc[0]

In [66]:
jojo

            b     d     e
jotaro    0.0   1.0   2.0
giorno    3.0   4.0   5.0
jonathan  6.0   7.0   8.0
josuke    9.0  10.0  11.0

In [67]:
series

b    0.0
d    1.0
e    2.0
Name: jotaro, dtype: float64

In [69]:
jojo - series

            b    d    e
jotaro    0.0  0.0  0.0
giorno    3.0  3.0  3.0
jonathan  6.0  6.0  6.0
josuke    9.0  9.0  9.0

In [70]:
jojo2 = pd.Series(range(3), index=['jolyne','joseph','jo2uke'])

In [72]:
series + jojo2

b        NaN
d        NaN
e        NaN
jo2uke   NaN
jolyne   NaN
joseph   NaN
dtype: float64

In [76]:
jojo3 = jojo['d']
jojo3

jotaro       1.0
giorno       4.0
jonathan     7.0
josuke      10.0
Name: d, dtype: float64

In [77]:
jojo.sub(jojo3, axis= 'index') # or axis = 0

            b    d    e
jotaro   -1.0  0.0  1.0
giorno   -1.0  0.0  1.0
jonathan -1.0  0.0  1.0
josuke   -1.0  0.0  1.0

### Function Application and Mapping

In [79]:
dorohedoro = pd.DataFrame(np.random.randn(4, 3), columns=list('abc'),
index=['Kaiman', 'Nikaidou', 'En', 'Shin'])
dorohedoro

                 a         b         c
Kaiman   -0.568073  0.075917  0.495873
Nikaidou -0.505271 -1.253091 -1.208762
En       -0.803797  1.147209  2.194949
Shin      1.375662  1.181188 -1.952689

In [80]:
np.abs(dorohedoro)

                 a         b         c
Kaiman    0.568073  0.075917  0.495873
Nikaidou  0.505271  1.253091  1.208762
En        0.803797  1.147209  2.194949
Shin      1.375662  1.181188  1.952689

In [81]:
f = lambda x: x.max() - x.min()

In [82]:
dorohedoro.apply(f)

a    2.179459
b    2.434280
c    4.147638
dtype: float64

In [83]:
jojo.apply(f, axis='columns')

jotaro      2.0
giorno      2.0
jonathan    2.0
josuke      2.0
dtype: float64

In [86]:
def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])
jojo.apply(f)

       b     d     e
min  0.0   1.0   2.0
max  9.0  10.0  11.0

In [87]:
format = lambda x: '%.2f' % x

In [89]:
jojo.applymap(format)

             b      d      e
jotaro    0.00   1.00   2.00
giorno    3.00   4.00   5.00
jonathan  6.00   7.00   8.00
josuke    9.00  10.00  11.00

In [90]:
jojo['e'].map(format)

jotaro       2.00
giorno       5.00
jonathan     8.00
josuke      11.00
Name: e, dtype: object